Revit 2017 API
ExternalResourceBrowserData.IsValidResouceName Method
 Checks whether the resource name is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public bool IsValidResouceName(
	string resourceName
)
Visual Basic
Public Function IsValidResouceName ( _
	resourceName As String _
) As Boolean
Visual C++
public:
bool IsValidResouceName(
	String^ resourceName
)
Parameters
resourceName
Type: System.String
 The resource name to check.
Return Value
 True if the name is a valid resource name, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace